Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/nvm.h
#define NVM_NVMCON2_VREAD_Pos                 _UINT32_(12)                                         /* (NVM_NVMCON2 Position)  */
#define NVM_NVMCON2_VREAD_Msk                 (_UINT32_(0x1) << NVM_NVMCON2_VREAD_Pos)             /* (NVM_NVMCON2 Mask) VREAD */
#define NVM_NVMCON2_VREAD(value)              (NVM_NVMCON2_VREAD_Msk & (_UINT32_(value) << NVM_NVMCON2_VREAD_Pos)) 
#define NVM_NVMCON2_CREAD_Pos                 _UINT32_(13)                                         /* (NVM_NVMCON2 Position)  */
#define NVM_NVMCON2_CREAD_Msk                 (_UINT32_(0x1) << NVM_NVMCON2_CREAD_Pos)             /* (NVM_NVMCON2 Mask) CREAD */
#define NVM_NVMCON2_CREAD(value)              (NVM_NVMCON2_CREAD_Msk & (_UINT32_(value) << NVM_NVMCON2_CREAD_Pos)) 

/* -------- NVM_NVMCON2CLR : (NVM Offset: 0x14) (R/W 32)  -------- */
#define NVM_NVMCON2CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMCON2CLR)   Reset Value */

#define NVM_NVMCON2CLR_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMCON2CLR) Register Mask  */


/* -------- NVM_NVMCON2SET : (NVM Offset: 0x18) (R/W 32)  -------- */
#define NVM_NVMCON2SET_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMCON2SET)   Reset Value */

#define NVM_NVMCON2SET_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMCON2SET) Register Mask  */


/* -------- NVM_NVMCON2INV : (NVM Offset: 0x1C) (R/W 32)  -------- */
#define NVM_NVMCON2INV_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMCON2INV)   Reset Value */

#define NVM_NVMCON2INV_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMCON2INV) Register Mask  */


/* -------- NVM_NVMKEY : (NVM Offset: 0x20) (R/W 32)  -------- */
#define NVM_NVMKEY_RESETVALUE                 _UINT32_(0x00)                                       /*  (NVM_NVMKEY)   Reset Value */

#define NVM_NVMKEY_NVMKEY_Pos                 _UINT32_(0)                                          /* (NVM_NVMKEY)  Position */
#define NVM_NVMKEY_NVMKEY_Msk                 (_UINT32_(0xFFFFFFFF) << NVM_NVMKEY_NVMKEY_Pos)      /* (NVM_NVMKEY)  Mask */
#define NVM_NVMKEY_NVMKEY(value)              (NVM_NVMKEY_NVMKEY_Msk & (_UINT32_(value) << NVM_NVMKEY_NVMKEY_Pos)) /* Assigment of value for NVMKEY in the NVM_NVMKEY register */
#define NVM_NVMKEY_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMKEY) Register Mask  */


/* -------- NVM_NVMADDR : (NVM Offset: 0x30) (R/W 32)  -------- */
#define NVM_NVMADDR_RESETVALUE                _UINT32_(0x00)                                       /*  (NVM_NVMADDR)   Reset Value */

#define NVM_NVMADDR_NVMADDR_Pos               _UINT32_(0)                                          /* (NVM_NVMADDR)  Position */
#define NVM_NVMADDR_NVMADDR_Msk               (_UINT32_(0xFFFFFFFF) << NVM_NVMADDR_NVMADDR_Pos)    /* (NVM_NVMADDR)  Mask */
#define NVM_NVMADDR_NVMADDR(value)            (NVM_NVMADDR_NVMADDR_Msk & (_UINT32_(value) << NVM_NVMADDR_NVMADDR_Pos)) /* Assigment of value for NVMADDR in the NVM_NVMADDR register */
#define NVM_NVMADDR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMADDR) Register Mask  */


/* -------- NVM_NVMDATA0 : (NVM Offset: 0x40) (R/W 32)  -------- */
#define NVM_NVMDATA0_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA0)   Reset Value */

#define NVM_NVMDATA0_NVMDATA0_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA0)  Position */
#define NVM_NVMDATA0_NVMDATA0_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA0_NVMDATA0_Pos)  /* (NVM_NVMDATA0)  Mask */
#define NVM_NVMDATA0_NVMDATA0(value)          (NVM_NVMDATA0_NVMDATA0_Msk & (_UINT32_(value) << NVM_NVMDATA0_NVMDATA0_Pos)) /* Assigment of value for NVMDATA0 in the NVM_NVMDATA0 register */
#define NVM_NVMDATA0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA0) Register Mask  */


/* -------- NVM_NVMDATA1 : (NVM Offset: 0x50) (R/W 32)  -------- */
#define NVM_NVMDATA1_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA1)   Reset Value */

#define NVM_NVMDATA1_NVMDATA1_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA1)  Position */
#define NVM_NVMDATA1_NVMDATA1_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA1_NVMDATA1_Pos)  /* (NVM_NVMDATA1)  Mask */
#define NVM_NVMDATA1_NVMDATA1(value)          (NVM_NVMDATA1_NVMDATA1_Msk & (_UINT32_(value) << NVM_NVMDATA1_NVMDATA1_Pos)) /* Assigment of value for NVMDATA1 in the NVM_NVMDATA1 register */
#define NVM_NVMDATA1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA1) Register Mask  */


/* -------- NVM_NVMDATA2 : (NVM Offset: 0x60) (R/W 32)  -------- */
#define NVM_NVMDATA2_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA2)   Reset Value */

#define NVM_NVMDATA2_NVMDATA2_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA2)  Position */
#define NVM_NVMDATA2_NVMDATA2_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA2_NVMDATA2_Pos)  /* (NVM_NVMDATA2)  Mask */
#define NVM_NVMDATA2_NVMDATA2(value)          (NVM_NVMDATA2_NVMDATA2_Msk & (_UINT32_(value) << NVM_NVMDATA2_NVMDATA2_Pos)) /* Assigment of value for NVMDATA2 in the NVM_NVMDATA2 register */
#define NVM_NVMDATA2_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA2) Register Mask  */


/* -------- NVM_NVMDATA3 : (NVM Offset: 0x70) (R/W 32)  -------- */
#define NVM_NVMDATA3_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA3)   Reset Value */

#define NVM_NVMDATA3_NVMDATA3_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA3)  Position */
#define NVM_NVMDATA3_NVMDATA3_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA3_NVMDATA3_Pos)  /* (NVM_NVMDATA3)  Mask */
#define NVM_NVMDATA3_NVMDATA3(value)          (NVM_NVMDATA3_NVMDATA3_Msk & (_UINT32_(value) << NVM_NVMDATA3_NVMDATA3_Pos)) /* Assigment of value for NVMDATA3 in the NVM_NVMDATA3 register */
#define NVM_NVMDATA3_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA3) Register Mask  */


/* -------- NVM_NVMDATA4 : (NVM Offset: 0x80) (R/W 32)  -------- */
#define NVM_NVMDATA4_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA4)   Reset Value */

